cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Corn Bread
:PROPERTIES:
:export_file_name: corn-bread
:export_hugo_custom_front_matter: :servings 8
:export_hugo_custom_front_matter+: :prep-time 5
:export_hugo_custom_front_matter+: :cook-time 20
:export_hugo_custom_front_matter+: :ready-in 25
:export_author: Linden
:END:
*** Ingredients

- 1 cup of cornmeal
- 3/4 cup of all-purpose flour
- 2-4 tablespoons of sugar
- 2 1/2 teaspoons of baking powder
- 1/2 teaspoon of salt
- 1 cup of milk
- 2 eggs
- 1/4 cup of butter, melted

*** Directions

1. Preheat oven to 400°F. Grease an 8x8x2-inch square or 9x1 1/2-inch round baking pan; set aside. In a medium bowl stir together cornmeal, flour, sugar, baking powder, and salt; set aside.
2.  In a small bowl whisk together the milk, eggs, and butter. Add milk mixture all at once to cornmeal mixture. Stir just until moistened. Pour batter into the prepared pan.
3.  Bake about 20 minutes or until edges are golden brown. Cool slightly; serve warm.

*Alternatively:*

1. In a medium bowl stir together cornmeal, flour, sugar, baking powder, and salt; set aside.
2. Heat a 1/2 inch of some vegetable oil in a cast iron skillet. Once hot, glob the batter into the skillet.
3. Cook turn over the cornbread until it is nice and crispy.

