content/recipe/corn-bread.md
---
title: "Corn Bread"
author: ["Linden"]
date: 2022-05-08T00:00:00-07:00
tags: ["GF"]
categories: ["side", "baking"]
draft: false
servings: 8
prep-time: 5
cook-time: 20
ready-in: 25
---

## Ingredients {#ingredients}

-   1 cup of cornmeal
-   3/4 cup of 1-1 gluten free all-purpose flour
-   2-4 tablespoons of sugar
-   2 1/2 teaspoons of baking powder
-   1/2 teaspoon of salt
-   1 cup of milk
-   2 eggs
-   1/4 cup of butter, melted


## Directions {#directions}

1.  Preheat oven to 400°F. Grease an 8x8x2-inch square or 9x1 1/2-inch round baking pan; set aside. In a medium bowl stir together cornmeal, flour, sugar, baking powder, and salt; set aside.
2.  In a small bowl whisk together the milk, eggs, and butter. Add milk mixture all at once to cornmeal mixture. Stir just until moistened. Pour batter into the prepared pan.
3.  Bake about 20 minutes or until edges are golden brown. Cool slightly; serve warm.

**Alternatively:**

1.  In a medium bowl stir together cornmeal, flour, sugar, baking powder, and salt; set aside.
2.  Heat a 1/2 inch of some vegetable oil in a cast iron skillet. Once hot, glob the batter into the skillet.
3.  Cook turn over the cornbread until it is nice and crispy.